{
  "url": "https://www.tamingtwins.com/beef-tacos/",
  "title": "Easy Beef Tacos {15 Minute Meal}",
  "content": "Easy Beef Tacos {15 Minute Meal}\nSkip to contentGet my BESTSELLING Recipe Books!Home › Collections › Under 15 minutesEasy Beef Tacos {15 Minute Meal}By Sarah Rossion  Jul 30, 20255 from 7 votesJump to Recipe →Jump to Step by Step VideosThis post may contain affiliate links.\nThese easy peasy Beef Tacos are your new midweek mince must have! (Try saying that three times fast..) This is a quick and delicious 15 minute meal that the whole family will love.\nYou know how much I LOVE an easy taco dish, and after creating various types of easy taco recipes, I realised I had never shared basic beef one.\nAnd because beef mince recipes are our saviours on most weeks in a family kitchen, I knew I had to put that right!\nFor this Beef Taco recipe I have used the beef cooking method similar to my Chilli Con Carne and Beef Burritos, but using a shortcut of ready-made fajita seasoning (because shortcuts are LIFE).\nWhy you’ll love this Beef Taco recipe\n⭐️ Easy prep-ahead dinner\n⭐️ Delicious flavours and shortcut hacks\n⭐️ Sociable and fun meal\nSarah’s Notes\nWhen we originally tested this recipe, we made them with tinned tomatoes, which made the filling a bit too ‘wet’ and left the tacos shells a little soggy and difficult to handle.\nInstead, the tomato puree addition keeps the flavour but dry enough to work as handheld food.\nIf you’re short of time, you can even make the filling ahead of time, meaning a really quick dinner to serve up when everyone’s hungry. I hope you love it!\nEasy Beef Taco Ingredients\nSunflower oil – Olive oil is fine too\nBeef mince – I use 5% fat\nFajita seasoning – The type in a herb jar rather than a pack or pouch as these are just pure spices rather than any added thickeners/additives\nGarlic granules\nTomato puree\nKidney beans\n‌To serve\nSmall tortilla wraps –  I use small wheat ones, but corn tortillas also work well if you can get hold of them, or wholewheat ones too\nSour cream – Or yoghurt\nIceberg lettuce\nSalad tomatoes\nCheese – I used grated cheddar but whatever you have is fine\nHow to make Beef Tacos\n1. Brown your beef mince in hot oil in a frying pan.  then add the rest of the meat ingredients and cook and per the recipe below.\n2. Add the fajita seasoning, garlic granules, tomato puree, kidney beans, water and a sprinkle of sea salt.\n3. Stir well and cook for a little longer, as per the full recipe below.\n4. Meanwhile, heat your tortillas and rice, and chop your toppings. Pile the fillings into the wraps or let everyone serve themselves.\nSubstitutions\nTaco fillings or side servings – Feel free to  experiment with your sides or go for your favourites. You could also add some dips such as sour cream, salsa and guacamole.\nDifferent mince – You could try this with pork or chicken mince if you like\nLeftovers\nIn the fridge You can keep the cooked meat from recipe in the fridge for 3 days. Reheat fully before serving or they’re fine to eat cold. You could use the beef for another style of dish, such as in pasta, a salad or with a jacket potato.\nIn the freezer The made-up tacos aren’t suitable for freezing, but if you want to freeze the beef filling, you can do this once it’s been cooked. Defrost thoroughly before heating up again in the pan.\nBatch cook The mince filling is also great for meal prep batch cooking.\nTop Tips\nWhat to serve with Beef Tacos\nMexican Style Salad\nVeggie Loaded Nachos\nHomemade Skin-On Fries\nTortilla Chips & Dips\nToasting the taco wraps\nYou can either put them in the oven, wrapped in foil, for 5 minutes. Or what I prefer to do for a little more flavour is char them over an open gas flame, using tongs. Make sure you’re VERY careful and don’t overdo it!\nFAQs\nDo you have more easy Mexican-style meals with beef mince? I do! Try out my Beef Burritos, Easy Chilli Con Carne or my Slow Cooker Beef Enchiladas.  Do you have other easy taco recipes? If you love tacos as much as we do, you could give my versions of Cauliflower Tacos, Prawn Tacos, Salmon Tacos and even Slow Cooker Chicken Tacos a go. (And just for fun, why not my Big Mac Tacos too? Yes it’s a thing and they’re sooo good.)If you’d like to learn more about tacos, this brilliant article outlines the differences between Mexican and Tex Mex food.\nLet me know how you got on and what you thought of these recipes. Please rate the recipe using the ⭐️ below.\nAlso I’d LOVE to see your cooking creations. If you’d like to share yours with me, you can tag me on Instagram (@tamingtwins).\nSaveSaved\nPin\nPrint\n5 from 7 votes\nEasy Beef Tacos {15 Minute Meal}\nBy Sarah Rossi\nThis easy 15-minute meal is fun, tasty and super simple. Beef Tacos are made up of a quick mince filling and your chosen extras in either soft tortilla wraps or hard shells.\nCook Time: 15 minutes minutesTotal Time: 15 minutes minutesServings: 4\nCook ModePrevent your screen from going dark\nIngredients 1x2x3x▢ 2 tsp   Sunflower oil▢ 500 g  (1.1 lb) Beef mince, I use 5% fat▢ 2 tbsp   Fajita seasoning▢ 2 tsp   Garlic granules▢ 2 tbsp   Tomato puree▢ 400 g  (14 oz) Kidney beans, 1x tin drained and rinsed▢ 100 ml  (0.5 cups) Water▢   Sea saltTo serve:▢ 8   Small tortillas wraps▢ 100 ml  (0.5 cups) Sour cream, Or yoghurt▢ 1/2    Iceberg lettuce, Shredded▢ 2   Salad tomatoes, Finely chopped▢ 60 g  (2 oz) Cheese, Grated\nInstructions Heat the oil in a saute pan over a medium heat. Add the beef and brown all over for about 5 minutes, breaking up with a spoon.Add the fajita seasoning, garlic granules, tomato puree, kidney beans, water and a sprinkle of sea salt. Cook for a further 5-10 minutes until the beans are hot and the meat is well cooked.Meanwhile, heat the tortillas according to the pack instructions (microwave, oven, gas flame or toaster all work!)Pile in the fillings (or let everyone help themselves) and serve!\nNotesToasting the wraps: You can either put them in the oven, wrapped in foil, for 5 minutes. Or what I prefer to do for a little more flavour is char them over an open gas flame, using tongs. Make sure you’re VERY careful and don’t overdo it!\nCheese: I use grated cheddar but choose your favourite.\nHard shell tacos: Go for these if you prefer.\nNutritionCalories: 637kcalCarbohydrates: 60gProtein: 46gFat: 24gSaturated Fat: 10gPolyunsaturated Fat: 3gMonounsaturated Fat: 8gTrans Fat: 0.4gCholesterol: 107mgSodium: 646mgPotassium: 1246mgFiber: 11gSugar: 7gVitamin A: 1193IUVitamin C: 13mgCalcium: 279mgIron: 9mgNutrition information is automatically calculated, so should only be used as an approximation.\nAdditional InfoCourse: Main CourseCuisine: Mexican\nLike this? Leave a comment and rating below!Mention @myusername or tag #myhashtag!\nThis post was originally published on August 9th, 2023. It was updated on July 30th, 2025 to add additional tips and step-by-step videos.\nShare:PinFacebookTweetYummlyEmail\nCategorized as:Beef, Beef Mince Recipes, Collections, Family Dinner Ideas, High Protein, Main Courses, Recipes, Tacos, Under 15 minutes\nPRE-ORDER NOW!\nYou all asked, I wrote it! Featuring 100 delicious SLOW COOKER recipes to make your dinners easier than ever. Available from 25th September 2025, order right now to be the first to get it!\nOrder Now\nOne PotMexican Chicken & Rice {One Pot}One PotMeatball Orzo Bake {One Pot}One Pot PastaMarry Me Chicken Orzo {One Pot Recipe}Under 30 minutesCheeseburger Pasta {One Pot Recipe}\nWelcome!\nHi, I'm Sarah. I help busy people decide 'What's for Dinner?' Find hundreds of recipes here, and also in my bestselling recipe book. Hope my recipes make your life easier ❤️\nMore About Me\n5 from 7 votes (5 ratings without comment)\nLeave a comment Cancel replyYour email address will not be published. Required fields are marked *\nRecipe Rating\nRecipe Rating\nComment * Name *\nEmail *\nΔ\nThis site uses Akismet to reduce spam. Learn how your comment data is processed.4 Comments\nEasy asf\nReply\nCould you use 25% beef mince for this recipe instead of 5%\nReply\nThis was super tasty, the whole family loved it! So easy to make as well.\nReply\nI’m not a lover of kidney beans, I think it’s the texture!! What could I use instead or could I omit?\nReply\nWelcome!\nHi, I'm Sarah. I help busy people decide 'What's for Dinner?' Find hundreds of recipes here, and also in my bestselling recipe books. Hope my recipes make your life easier ❤️\nMore About Me\nPorkToad in the Hole {Foolproof Recipe!}BeefCottage Pie {Easy Recipe}SoupBroccoli and Stilton SoupSlow Cooker ChickenSlow Cooker Chicken Curry – Easiest Ever Recipe!\nSlow Cooker ChickenSlow Cooker Marry Me ChickenSide DishesYorkshire Puddings {Foolproof Recipe!}Sweet ThingsEasy Flapjacks {Foolproof Recipe!}Slow CookerSlow Cooker Bolognese {No Browning Recipe!}As Seen In\nYour vote:\nName *\nEmail *\nSomething went wrong. Please try again.",
  "structured_data": null,
  "scraped_at": "2025-08-24T18:17:41.552744"
}