{
  "url": "https://www.bbcgoodfood.com/recipes/quick-spicy-nasi-goreng",
  "title": "Quick & spicy nasi goreng recipe | Good Food",
  "content": "Quick & spicy nasi goreng recipe | Good FoodSkip to main contentQuick & spicy nasi gorengChelsie CollinsSave recipeServes 1EasyPrep: 10 minsCook: 10 minsA star rating of 4.5 out of 5.54 ratingsRateloading...Save on the washing up with this speedy supper for one, with wholesome ingredients like Chinese cabbage and brown rice, finished with a fried eggEasily doubledVegetarianPrintAdSkip to ingredientsAlternativesComplete the dishShowing items 1 to 3 of 3Sesame & ginger green beansA star rating of 4.7 out of 5.9 ratingsThis easy side is good for you and full of flavourMini prawn & sweetcorn cakesA star rating of 5 out of 5.5 ratingsThese fritters are lightly spiced with cumin. Serve as a starter or nibbleTropical fruits in lemongrass syrupA star rating of 5 out of 5.1 ratingLemongrass adds an intriguing citrus taste and fragrance to the syrup for this exotic fruit saladIngredientsNutrition2 tbsp vegetable oil1 small onion finely sliced2 garlic cloves crushed1 carrot grated½ small Chinese or Savoy cabbage shredded175g cooked brown rice1 tbsp fish sauce (optional)1 tbsp soy sauce1 egghot sriracha chilli sauce, to serveNutrition: per servingkcal540fat30gsaturates5gcarbs47gsugars11gfibre9gprotein17gsalt6.4gAdMethodstep 1Heat the oil in a wok over a high heat. Add the onion and cook for 3-4 mins until softened and slightly caramelised. Add the garlic and stir for 1 min.step 2Toss in the carrot and cabbage, then cook for 1-2 mins. Add the rice and stir to warm through. Pour in the fish sauce, soy sauce and some seasoning. Make a well in the centre of the wok and crack in the egg. Fry until the white is nearly set.step 3Serve the rice in a large bowl, topped with the fried egg and drizzled with chilli sauce.Recipe from Good Food magazine, October 2015AdComments, questions and tipsRate this recipeWhat is your star rating out of 5?1 star out of 52 stars out of 53 stars out of 54 stars out of 55 stars out of 5Choose the type of message you'd like to postChoose the type of message you'd like to postCommentQuestionTipOverall ratingA star rating of 4.5 out of 5.54 ratingsAdAdSubscribe to Good Food magazineSubscribe to Good Food magazine for delicious seasonal recipes, easy midweek meals and more – now just 5 issues for £5.Subscribe todayAdExplore our recipe appSubscribe now and get access to exclusive recipes, meal plans, podcasts and more.Try todayGood Food magazineSubscribe to Good Food magazine for delicious seasonal recipes – now just 5 issues for £5.Subscribe todayPodcastTune in to the latest episodes to hear our experts discuss all things food.More",
  "structured_data": null,
  "scraped_at": "2025-08-24T18:16:02.930541"
}