{
  "url": "https://www.tamingtwins.com/creamy-bacon-pasta/",
  "title": "Creamy Bacon Pasta {10 Minute Meal}",
  "content": "Creamy Bacon Pasta {10 Minute Meal}\nSkip to contentGet my BESTSELLING Recipe Books!Home › Collections › Under 15 minutesCreamy Bacon Pasta {10 Minute Meal}By Sarah RossiUpdated May 15, 20254.99 from 58 votesJump to Recipe →This post may contain affiliate links.\nA simple creamy Bacon Pasta ready super quickly but packed with heaps of flavour. This store cupboard saviour might just become a new favourite in your family!\nIt’s no secret that I’m a BIG fan of simple pasta dishes, and I think most of us are. What we need is variation though, so here’s another 10 minute cracker to get your family licking their lips and asking for seconds.\nWhen I created this Pasta with Bacon recipe, I knew I wanted to replicate what’s great about my Prawn Pasta, Halloumi Pasta and Smoked Salmon Pasta recipes (namely speed, deliciousness and simplicity). I think we’ve nailed it here and I hope you love it! Get it on those meal plans – it’s another easy midweek win.\nWhy you’ll love this Creamy Bacon Pasta recipe\n⭐️ Ready in just 10 MINUTES\n⭐️ A few inexpensive ingredients\n⭐️ So tasty and healthy\nHow we came up with this recipe\nI wanted to make a quick pasta recipe that had bacon as the star of the show but also had heaps of flavour quickly.\nA pack of bacon is quite often at the back of the fridge, has a relatively long shelf life so we can reach for it on time-poor days, and it brings SO much flavour to a dish.\nWe initially tried making this with tomato puree, but it didn’t quite hit the mark in terms of flavour.\nHaving used sundried tomatoes recently in my Marry Me Chicken recipe, we thought we’d use that here and… OH HELLO! It was so good. The addition of that shortcut of cream cheese creates a delicious creamy and decadent sauce that offsets the bacon’s saltiness and the peas’ sweetness perfectly.\nBacon Pasta Ingredients notes\nPasta – I’ve used spaghetti, which works perfectly for this dish, but use what you like\nOnion and garlic – Frozen or fresh is fine here for these ingredients\nBacon – I like to use streaky smoked bacon for this pasta dish as it has loads of flavour, but if all you have is back bacon or unsmoked, that’s totally fine too\nSundried tomatoes – The type in oil, not the dry type which take a little longer to soften. See notes below for more info on this ingredient\nPeas – I like to use frozen peas as they’re handy to have in store, and they’re sweet and delicious\nCream cheese – Any kind is fine to use\nHow to make Bacon Pasta\n1. Put your pasta onto boil and fry the onions, garlic and bacon together until cooked.\n2. Add in the sundried tomatoes and add your peas to the pasta water for the last 5 minutes of cooking time.\n3. Reduce the heat and add tomato puree and cream cheese to the pan. Stir well.\n4. Drain the cooked pasta and peas, then add to the pan with bacon etc. Give everything a good stir and serve.\nHint: Reserve a little pasta cooking water so you can help the sauce to loosen up when stirring the dish together. It will give a nice silky smooth finish to the pasta.\nLeftovers\nIn the fridge You can keep bacon pasta leftovers in the fridge for 3 days. Reheat fully in the microwave or hob before serving.\nYou may need a drop of water to loosen the sauce up again.In the freezer I’m not a big fan of freezing pasta as it can go quite mushy when defrosted and reheated. All that said, there’s nothing wrong with freezing for a lunch if you have leftovers. It’s just not quite as good as fresh or reheated from the fridge.\nNotes on sundried tomatoes\nType: Use the sundried tomatoes in oil here as they are much softer than the dry type. If you want to hide them from children, cut them up very small and they’ll almost melt into the sauce.\nAmount to use: We have used 170g/6oz here. This is the drained weight of a 280g/10oz jar of sundried tomatoes in oil from Aldi. If your jar weighs slightly more or less, that’s fine. It doesn’t need to be this exact weight.\nSave the oil: There will be oil left in the jar. I haven’t used it in this recipe (as the bacon has enough fat), but you can put the lid on, pop it in the fridge and save it for cooking in another recipe as it will have lots of flavour.\nUnder 15 minutesOrzo Pasta Salad {15 Minute Meal}Under 15 minutesHalloumi Pasta {15 Minute Meal}Under 15 minutesTuna Pasta SaladUnder 15 minutesBaked Tortellini ‘Lasagne’ {10 Minute Meal}\nFAQ\nHow can I make this a little ‘saucier’? Before you drain your pasta, save a cup of the cooking water before it goes down the sink. You can add a little at a time to the dish when you’re stirring it together. It helps to loosen up the ingredients and have a silky sauce finish – always worth doing this for any pasta dish that’s not overly saucy!\nLet me know how you got on and what you thought of these recipes. Please rate the recipe using the ⭐️ below.\nAlso I’d LOVE to see your cooking creations. If you’d like to share yours with me, you can tag me on Instagram (@tamingtwins).\nSaveSaved\nPin\nPrint\n4.99 from 58 votes\nCreamy Bacon Pasta {10 Minute Meal}\nBy Sarah Rossi\nWhen we need a quick dinner that everyone will love and we don’t want to use loads of ingredients, this Creamy Bacon Pasta recipe is here to save you. Full of flavour, hearty and satisfying, and on your plate in 10 minutes.\nCook Time: 10 minutes minutesTotal Time: 10 minutes minutesServings: 4\nCook ModePrevent your screen from going dark\nIngredients 1x2x3x▢ 300 g  (11 oz) Dried pasta, I use spaghetti▢ 1   Onion, Peeled and finely chopped▢ 2   Garlic cloves, Or puree▢ 240 g  (8.5 oz) Streaky smoked bacon, Chopped into 1cm strips▢ 170 g  (6 oz) Sundried tomatoes , The type in oil, drained and chopped into thin strips▢ 4 tbsp   Tomato puree▢ 200 g  (7 oz) Peas, Frozen is fine▢ 200 g  (7 oz) Cream cheese▢   Sea salt and freshly ground black pepper\nInstructions Cook your pasta according to the instructions on the pack, in a pan of well salted water.Put your onions, garlic, tomatoes and bacon into a pan and fry over a medium heat for 5-10 minutes until the onions are softened and the bacon is cooked through (you shouldn’t need any oil as the bacon will release some).Five minutes before your pasta has finished cooking, add the peas to the pasta pan and continue cooking as normal.When the bacon and onions are cooked, reduce the heat to low and add the tomato puree and cream cheese. Give everything a good stir and cook for 2-3 minutes until just heated through.When the pasta and peas are cooked, drain (reserve a cup of the cooking water) and add the pasta and peas into the pan with the bacon and vegetables. Add black pepper and a splash of reserved cooking water if you'd like a more runny sauce.Give everything a good stir and serve immediately. (This shouldn't need any more salt as the bacon is salted, but taste it to be sure.)\nNotesPasta: I’ve used spaghetti, which works perfectly for this dish, but use what you like\nOnion and garlic: Frozen or fresh is fine here for these ingredients\nBacon: I like to use streaky smoked bacon for this pasta dish as it has loads of flavour, but if all you have is back bacon or unsmoked, that’s totally fine too\nPeas: I like to use frozen peas as they’re handy to have in store, and they’re sweet and delicious\nCream cheese: Any kind is fine to use\nSundried tomatoes: Use the sundried tomatoes in oil here as they are much softer than the dry type. If you want to hide them from children, cut them up very small and they’ll almost melt into the sauce. Quantities don’t have to be exact.\nPasta water: Reserve a little pasta cooking water so you can help the sauce to loosen up when stirring the dish together. It will give a nice silky smooth finish to the pasta.\nNutritionCalories: 619kcalCarbohydrates: 95gProtein: 35gFat: 13gSaturated Fat: 6gPolyunsaturated Fat: 1gMonounsaturated Fat: 2gCholesterol: 27mgSodium: 1438mgPotassium: 1987mgFiber: 11gSugar: 26gVitamin A: 1112IUVitamin C: 41mgCalcium: 161mgIron: 6mgNutrition information is automatically calculated, so should only be used as an approximation.\nAdditional InfoCourse: Main CourseCuisine: Family Food\nLike this? Leave a comment and rating below!Mention @myusername or tag #myhashtag!\nThis post was originally published on August 4, 2023 and updated later to make improvements.Share:PinFacebookTweetYummlyEmail\nCategorized as:Collections, Family Dinner Ideas, Main Courses, Pasta, Pork, Recipes, Under 15 minutes, Under 30 Minute Pasta Recipes\nPRE-ORDER NOW!\nYou all asked, I wrote it! Featuring 100 delicious SLOW COOKER recipes to make your dinners easier than ever. Available from 25th September 2025, order right now to be the first to get it!\nOrder Now\nOne PotMexican Chicken & Rice {One Pot}One PotMeatball Orzo Bake {One Pot}One Pot PastaMarry Me Chicken Orzo {One Pot Recipe}Under 30 minutesCheeseburger Pasta {One Pot Recipe}\nWelcome!\nHi, I'm Sarah. I help busy people decide 'What's for Dinner?' Find hundreds of recipes here, and also in my bestselling recipe book. Hope my recipes make your life easier ❤️\nMore About Me\n4.99 from 58 votes (39 ratings without comment)\nLeave a comment Cancel replyYour email address will not be published. Required fields are marked *\nRecipe Rating\nRecipe Rating\nComment * Name *\nEmail *\nΔ\nThis site uses Akismet to reduce spam. Learn how your comment data is processed.27 Comments\nFound this recipe because I had bacon that I needed to use! As a Sarah Rossi fan I knew this simple and quick recipe was worth a try (and I had all the ingredients in too!).  Wow, very easy to make and very tasty.  I added more of the pasta water as I like it more saucy and added some fresh grated grana Pacino cheese sprinkled on the top, delicious. I’ll definitely be making this again soon…even before the bacon is reaching its useby date!! Lovely 💗\nReply\nHi – I  am addicted to your recipes.  I’ve always been a bit of a ready meal person – only from M&S though but since someone brought me round some stilton and broccoli soup when I was poorly over Christmas which I loved so I looked online fore a recipe for it and came across yours!  I have since made it 4 times – once for a friend who loved it too.  I have also made the streaky bacon pasta but unfortunately, I love it so much that on one occasion I ate it it all in one evening – I just kept going back for more ….\nReply\nI added sweetcorn my boy will not eat peas\nI used about half pack of cooking bacon opened and leftovers\nI was thinking about adding mushrooms sliced I had some leftover would of fried them with the bacon what do you think\nReply\nI have now made this recipe 3 times in the last 2 weeks and am doing it again today!  I love it – simple and easy to make and so tasty1. I have also made the stilton and broccoli soup and couple of times which is amazing also!  Plenty more to explore but I love these 2 so much that I just keep making them……\nReply\nQuick and Easy and Delicious using everyday ingredients that I already had in the kitchen.  I will cook that again!\nReply\nThe flavours of this dish! Can’t wait to make again.\nReply\nWelcome!\nHi, I'm Sarah. I help busy people decide 'What's for Dinner?' Find hundreds of recipes here, and also in my bestselling recipe books. Hope my recipes make your life easier ❤️\nMore About Me\nPorkToad in the Hole {Foolproof Recipe!}BeefCottage Pie {Easy Recipe}SoupBroccoli and Stilton SoupSlow Cooker ChickenSlow Cooker Chicken Curry – Easiest Ever Recipe!\nSlow Cooker ChickenSlow Cooker Marry Me ChickenSide DishesYorkshire Puddings {Foolproof Recipe!}Sweet ThingsEasy Flapjacks {Foolproof Recipe!}Slow CookerSlow Cooker Bolognese {No Browning Recipe!}As Seen In\nYour vote:\nName *\nEmail *\nSomething went wrong. Please try again.",
  "structured_data": null,
  "recipe_sections": {
    "ingredients": [
      "A pack of bacon is quite often at the back of the fridge, has a relatively long shelf life so we can reach for it on time-poor days, and it brings SO much flavour to a dish.",
      "We initially tried making this with tomato puree, but it didn’t quite hit the mark in terms of flavour.",
      "Having used sundried tomatoes recently in my Marry Me Chicken recipe, we thought we’d use that here and… OH HELLO! It was so good. The addition of that shortcut of cream cheese creates a delicious creamy and decadent sauce that offsets the bacon’s saltiness and the peas’ sweetness perfectly.",
      "Peas: I like to use frozen peas as they’re handy to have in store, and they’re sweet and delicious",
      "Pasta water: Reserve a little pasta cooking water so you can help the sauce to loosen up when stirring the dish together. It will give a nice silky smooth finish to the pasta.",
      "Like this? Leave a comment and rating below!Mention @myusername or tag #myhashtag!",
      "This post was originally published on August 4, 2023 and updated later to make improvements.Share:PinFacebookTweetYummlyEmail",
      "You all asked, I wrote it! Featuring 100 delicious SLOW COOKER recipes to make your dinners easier than ever. Available from 25th September 2025, order right now to be the first to get it!",
      "Hi, I'm Sarah. I help busy people decide 'What's for Dinner?' Find hundreds of recipes here, and also in my bestselling recipe book. Hope my recipes make your life easier ❤️",
      "Found this recipe because I had bacon that I needed to use! As a Sarah Rossi fan I knew this simple and quick recipe was worth a try (and I had all the ingredients in too!).  Wow, very easy to make and very tasty.  I added more of the pasta water as I like it more saucy and added some fresh grated grana Pacino cheese sprinkled on the top, delicious. I’ll definitely be making this again soon…even before the bacon is reaching its useby date!! Lovely 💗",
      "Hi – I  am addicted to your recipes.  I’ve always been a bit of a ready meal person – only from M&S though but since someone brought me round some stilton and broccoli soup when I was poorly over Christmas which I loved so I looked online fore a recipe for it and came across yours!  I have since made it 4 times – once for a friend who loved it too.  I have also made the streaky bacon pasta but unfortunately, I love it so much that on one occasion I ate it it all in one evening – I just kept going back for more ….",
      "I used about half pack of cooking bacon opened and leftovers",
      "I was thinking about adding mushrooms sliced I had some leftover would of fried them with the bacon what do you think",
      "I have now made this recipe 3 times in the last 2 weeks and am doing it again today!  I love it – simple and easy to make and so tasty1. I have also made the stilton and broccoli soup and couple of times which is amazing also!  Plenty more to explore but I love these 2 so much that I just keep making them……",
      "Quick and Easy and Delicious using everyday ingredients that I already had in the kitchen.  I will cook that again!",
      "Hi, I'm Sarah. I help busy people decide 'What's for Dinner?' Find hundreds of recipes here, and also in my bestselling recipe books. Hope my recipes make your life easier ❤️",
      "Slow Cooker ChickenSlow Cooker Marry Me ChickenSide DishesYorkshire Puddings {Foolproof Recipe!}Sweet ThingsEasy Flapjacks {Foolproof Recipe!}Slow CookerSlow Cooker Bolognese {No Browning Recipe!}As Seen In",
      "Something went wrong. Please try again."
    ],
    "instructions": []
  },
  "scraped_at": "2025-08-29T17:57:36.707841"
}