{
  "url": "https://www.youtube.com/watch?v=iC0sMQYl6YE",
  "title": "Rajma Rice Recipe | Rajma Chawal  Recipe | jhat pat Rajma Banane ka Easy Tareekha",
  "duration": 649,
  "content": "Kind: captions Language: en [Music] [Music] [Music] Assalamu Alaikum friend welcome to my channel Assalamu Alaikum friend welcome to my channel Assalamu Alaikum friend welcome to my channel sh cooking.  So see, today I have brought for you sh cooking.  So see, today I have brought for you sh cooking.  So see, today I have brought for you again a new recipe and a again a new recipe and a again a new recipe and a very tasty Rajma recipe. very tasty Rajma recipe. very tasty Rajma recipe. So many people like it very So many people like it very So many people like it very much.  Many people much.  Many people much.  Many people also call it Lobia.  So please guys, you also call it Lobia.  So please guys, you also call it Lobia.  So please guys, you also tell me by commenting also tell me by commenting also tell me by commenting what it is called in your place.  We what it is called in your place.  We what it is called in your place.  We call it Rajma only.  So you can see call it Rajma only.  So you can see call it Rajma only.  So you can see how amazing its look is and Rajma how amazing its look is and Rajma how amazing its look is and Rajma Chawal is a favorite of many people. Chawal is a favorite of many people. Chawal is a favorite of many people. Believe me, everyone likes Believe me, everyone likes Believe me, everyone likes Rajma Chawal so much.  Look at its gravy, it is Rajma Chawal so much.  Look at its gravy, it is Rajma Chawal so much.  Look at its gravy, it is not too thick i.e. thin.  It is a little not too thick i.e. thin.  It is a little not too thick i.e. thin.  It is a little thick and is very easy to make thick and is very easy to make thick and is very easy to make and turns out to be very yummy.  So and turns out to be very yummy.  So and turns out to be very yummy.  So let us prepare to make it.  So let us prepare to make it.  So let us prepare to make it.  So look guys you can customize the gravy. look guys you can customize the gravy. look guys you can customize the gravy. I told you earlier also that I told you earlier also that I told you earlier also that if you want, you can keep the gravy a little thin. if you want, you can keep the gravy a little thin. if you want, you can keep the gravy a little thin. But the gravy of kidney beans is a little thick. But the gravy of kidney beans is a little thick. But the gravy of kidney beans is a little thick. So you can keep the gravy as per your choice So you can keep the gravy as per your choice So you can keep the gravy as per your choice and it tastes great with rice. and it tastes great with rice. and it tastes great with rice. So just make it quickly and So just make it quickly and So just make it quickly and enjoy it and please watch my recipe enjoy it and please watch my recipe enjoy it and please watch my recipe completely and please like it and completely and please like it and completely and please like it and also subscribe to the channel.  So let us also subscribe to the channel.  So let us also subscribe to the channel.  So let us prepare to make it.  Look here, prepare to make it.  Look here, prepare to make it.  Look here, I have taken this kidney bean.  So look, I have taken this kidney bean.  So look, I have taken this kidney bean.  So look, I have taken brown kidney beans here I have taken brown kidney beans here I have taken brown kidney beans here and look, I have and look, I have and look, I have soaked them overnight.  I have kept it soaked for about 7 to 8 hours, 9 soaked them overnight.  I have kept it soaked for about 7 to 8 hours, 9 soaked them overnight.  I have kept it soaked for about 7 to 8 hours, 9 hours.  So hours.  So hours.  So look, I had kept it in half quantity. look, I had kept it in half quantity. look, I had kept it in half quantity. So look, it has become double.  So So look, it has become double.  So So look, it has become double.  So you can soak it as much as you want. you can soak it as much as you want. you can soak it as much as you want. If you do not have time, then If you do not have time, then If you do not have time, then you can soak it in hot water for two to three hours and you can soak it in hot water for two to three hours and you can soak it in hot water for two to three hours and it will swell very well. it will swell very well. it will swell very well. So just look, we have the cooker here. So just look, we have the cooker here. So just look, we have the cooker here. We put it in the cooker along with water We put it in the cooker along with water We put it in the cooker along with water because we have just cleaned the water.  So because we have just cleaned the water.  So because we have just cleaned the water.  So we add this to the we add this to the we add this to the kidney beans along with water.  Now you don't have to add too much water kidney beans along with water.  Now you don't have to add too much water kidney beans along with water.  Now you don't have to add too much water in it.  So see, I have added about a glass of water in it. in it.  So see, I have added about a glass of water in it. in it.  So see, I have added about a glass of water in it. And And And I put a teaspoon of I put a teaspoon of I put a teaspoon of salt here.  Now I will just add salt and salt here.  Now I will just add salt and salt here.  Now I will just add salt and do it.  I will let it whistle twice because do it.  I will let it whistle twice because do it.  I will let it whistle twice because we have to boil it.  So I will whistle it twice we have to boil it.  So I will whistle it twice we have to boil it.  So I will whistle it twice and after two whistles I will turn and after two whistles I will turn and after two whistles I will turn off the flame.  So, as I told you earlier, off the flame.  So, as I told you earlier, off the flame.  So, as I told you earlier, friend, if you like the video then friend, if you like the video then friend, if you like the video then please do like it.  Now let us do further please do like it.  Now let us do further please do like it.  Now let us do further preparations.  Look here, I have taken two preparations.  Look here, I have taken two preparations.  Look here, I have taken two onions and made a coarse paste of them in this manner. onions and made a coarse paste of them in this manner. onions and made a coarse paste of them in this manner. Here I have taken Here I have taken Here I have taken a big size tomato.  I have made a paste of this also. a big size tomato.  I have made a paste of this also. a big size tomato.  I have made a paste of this also. So just look here, our So just look here, our So just look here, our city has arrived.  Two cities have arrived. city has arrived.  Two cities have arrived. city has arrived.  Two cities have arrived. Here I turn off the flame and here Here I turn off the flame and here Here I turn off the flame and here you remember that we should do this only after the steam comes out. you remember that we should do this only after the steam comes out. you remember that we should do this only after the steam comes out. So guys, after the steam comes out, So guys, after the steam comes out, So guys, after the steam comes out, we will remove the lid.  So let's we will remove the lid.  So let's we will remove the lid.  So let's prepare further.  Look here, I have prepare further.  Look here, I have prepare further.  Look here, I have taken a pan and put mustard taken a pan and put mustard taken a pan and put mustard oil in it.  So the taste of mustard oil oil in it.  So the taste of mustard oil oil in it.  So the taste of mustard oil becomes even more amazing.  If you want, you becomes even more amazing.  If you want, you becomes even more amazing.  If you want, you can use refined oil.  Here after adding mustard oil, can use refined oil.  Here after adding mustard oil, can use refined oil.  Here after adding mustard oil, I took one teaspoon cumin seeds and I took one teaspoon cumin seeds and I took one teaspoon cumin seeds and some whole spices like cloves and cinnamon. some whole spices like cloves and cinnamon. some whole spices like cloves and cinnamon. So guys, just see, when it So guys, just see, when it So guys, just see, when it starts crackling well then we will starts crackling well then we will starts crackling well then we will add the spices in it.  So first of all see that it starts add the spices in it.  So first of all see that it starts add the spices in it.  So first of all see that it starts crackling very well so that its crackling very well so that its crackling very well so that its Saudi aroma of spices Saudi aroma of spices Saudi aroma of spices comes into it well.  So comes into it well.  So comes into it well.  So after this we will add onion paste here. after this we will add onion paste here. after this we will add onion paste here. If you want, you can also chop the onion finely in this manner and If you want, you can also chop the onion finely in this manner and If you want, you can also chop the onion finely in this manner and add it to it. add it to it. add it to it. So guys, you can add it as per your choice.  If So guys, you can add it as per your choice.  If So guys, you can add it as per your choice.  If you want, you can also you want, you can also finely chop the bhurji onion and add it to it. finely chop the bhurji onion and add it to it. finely chop the bhurji onion and add it to it. But what if we But what if we But what if we make a coarse paste of it then the gravy turns out to be very tasty. make a coarse paste of it then the gravy turns out to be very tasty. make a coarse paste of it then the gravy turns out to be very tasty. And our gravy is very good. And our gravy is very good. And our gravy is very good. What does it matter, when we What does it matter, when we What does it matter, when we chop onions finely for bhurji, chop onions finely for bhurji, chop onions finely for bhurji, it happens a lot that sometimes it is not a mistake. it happens a lot that sometimes it is not a mistake. it happens a lot that sometimes it is not a mistake. So for this, if it So for this, if it So for this, if it comes up with our Rajma Rice then it does not taste good. comes up with our Rajma Rice then it does not taste good. comes up with our Rajma Rice then it does not taste good. So what should you do for this?  The best thing So what should you do for this?  The best thing So what should you do for this?  The best thing you can do is make a paste of you can do is make a paste of you can do is make a paste of onion, just grind it once or twice in the mixer jar onion, just grind it once or twice in the mixer jar onion, just grind it once or twice in the mixer jar and it becomes a very good paste. and it becomes a very good paste. and it becomes a very good paste. So just see, we have fried it for one to two So just see, we have fried it for one to two So just see, we have fried it for one to two minutes and see, there are some basic minutes and see, there are some basic minutes and see, there are some basic spices which are there, coriander, chilli and salt spices which are there, coriander, chilli and salt spices which are there, coriander, chilli and salt , turmeric powder, cumin.  Just the basic , turmeric powder, cumin.  Just the basic , turmeric powder, cumin.  Just the basic spices are homemade.  That is what you have to put in it. spices are homemade.  That is what you have to put in it. spices are homemade.  That is what you have to put in it. And first I add one teaspoon of And first I add one teaspoon of And first I add one teaspoon of ginger garlic paste here.  So see, I have ginger garlic paste here.  So see, I have added one teaspoon of ginger garlic paste here. added one teaspoon of ginger garlic paste here. added one teaspoon of ginger garlic paste here. I also fry this well in oil. I also fry this well in oil. I also fry this well in oil. After this I will add After this I will add After this I will add tomato puree to it.  Look, add tomato puree tomato puree to it.  Look, add tomato puree tomato puree to it.  Look, add tomato puree to it and fry it well. to it and fry it well. to it and fry it well. Now Now Now we will add our spices into it.  And guys, please, my we will add our spices into it.  And guys, please, my we will add our spices into it.  And guys, please, my request to you is that request to you is that request to you is that please skip the noises of my children from outside please skip the noises of my children from outside please skip the noises of my children from outside and please like my videos, share them, and please like my videos, share them, and please like my videos, share them, subscribe to my channel and subscribe to my channel and subscribe to my channel and please press the bell icon so that please press the bell icon so that please press the bell icon so that you get the upcoming notifications of my videos. you get the upcoming notifications of my videos. you get the upcoming notifications of my videos. So just see, I have So just see, I have So just see, I have added the spices here properly. added the spices here properly. added the spices here properly. We have added all the spices to it. We have added all the spices to it. We have added all the spices to it. So, the best thing in making Rajma is So, the best thing in making Rajma is So, the best thing in making Rajma is that you have to roast the spices very that you have to roast the spices very that you have to roast the spices very well because well because well because the better we roast the spices, the better we roast the spices, the better we roast the spices, the better our gravy will be.  So for this the better our gravy will be.  So for this the better our gravy will be.  So for this we have to fry the spices very well. we have to fry the spices very well. we have to fry the spices very well. So just see, I have So just see, I have So just see, I have added all the spices here and now we have to added all the spices here and now we have to added all the spices here and now we have to roast it very well.  So roast it very well.  So roast it very well.  So I also add a little water to it I also add a little water to it I also add a little water to it so that our spices do not burn and get roasted very well. so that our spices do not burn and get roasted very well. so that our spices do not burn and get roasted very well. And when our oil gets And when our oil gets And when our oil gets separated, our masala will be roasted and separated, our masala will be roasted and separated, our masala will be roasted and ready.  After that we ready.  After that we ready.  After that we will add kidney beans in it.  So guys, there are two types of kidney beans.  Another one is the will add kidney beans in it.  So guys, there are two types of kidney beans.  Another one is the white kidney beans with edges.  So if you want, you white kidney beans with edges.  So if you want, you white kidney beans with edges.  So if you want, you can take that also because there is no difference in the taste. can take that also because there is no difference in the taste. can take that also because there is no difference in the taste. It is not that It is not that It is not that its taste is better.  Its taste its taste is better.  Its taste its taste is better.  Its taste is less good.  But both are the same.  The taste is less good.  But both are the same.  The taste is less good.  But both are the same.  The taste of both is equal.  So you of both is equal.  So you can use either brown or white edged kidney beans, whichever you want.  The test will be the can use either brown or white edged kidney beans, whichever you want.  The test will be the can use either brown or white edged kidney beans, whichever you want.  The test will be the same for both.  So you can see that it will same for both.  So you can see that it will take some time for us to roast the spices.  So I will put a lead here take some time for us to roast the spices.  So I will put a lead here take some time for us to roast the spices.  So I will put a lead here because its splash is coming up. because its splash is coming up. because its splash is coming up. And let's go here, our steam has also been And let's go here, our steam has also been And let's go here, our steam has also been released.  Let us check whether our released.  Let us check whether our released.  Let us check whether our kidney beans are cooked or not.  So kidney beans are cooked or not.  So kidney beans are cooked or not.  So I just whistled twice.  After two whistles, let I just whistled twice.  After two whistles, let I just whistled twice.  After two whistles, let me remove the lid and see whether the me remove the lid and see whether the me remove the lid and see whether the kidney beans are cooked or not.  So you can see kidney beans are cooked or not.  So you can see kidney beans are cooked or not.  So you can see how good our kidney beans are. how good our kidney beans are. how good our kidney beans are. Exactly means it is becoming soft.  It is Exactly means it is becoming soft.  It is Exactly means it is becoming soft.  It is not broken and is very good.  So you can see not broken and is very good.  So you can see not broken and is very good.  So you can see we need it this way.  Do we need it this way.  Do we need it this way.  Do n't choke too much.  If you whistle n't choke too much.  If you whistle n't choke too much.  If you whistle extra than two whistles, it will get extra than two whistles, it will get extra than two whistles, it will get cooked too much and all the kidney beans will burst and cooked too much and all the kidney beans will burst and cooked too much and all the kidney beans will burst and break.  So for this we have to do such a thing break.  So for this we have to do such a thing break.  So for this we have to do such a thing that the kidney beans, I mean, become soft and also that the kidney beans, I mean, become soft and also that the kidney beans, I mean, become soft and also remain good and stand firm.  It is not that it remain good and stand firm.  It is not that it remain good and stand firm.  It is not that it breaks into pieces and falls apart.  So just look, it's been four breaks into pieces and falls apart.  So just look, it's been four breaks into pieces and falls apart.  So just look, it's been four to five minutes.  Look, to five minutes.  Look, to five minutes.  Look, our spices are already roasted.  Look how our spices are already roasted.  Look how our spices are already roasted.  Look how well the oil has separated.  All our oil has well the oil has separated.  All our oil has well the oil has separated.  All our oil has come up.  Meaning that our masala has been roasted.  The come up.  Meaning that our masala has been roasted.  The come up.  Meaning that our masala has been roasted.  The hallmark of roasting spices is that the hallmark of roasting spices is that the hallmark of roasting spices is that the oil will separate.  All the oil will come to the top. oil will separate.  All the oil will come to the top. oil will separate.  All the oil will come to the top. So it means our spices will get roasted. So it means our spices will get roasted. So it means our spices will get roasted. And see, the bubbles that are rising And see, the bubbles that are rising And see, the bubbles that are rising in the spices in this manner mean that our spices have been in the spices in this manner mean that our spices have been in the spices in this manner mean that our spices have been completely roasted and ready.  So completely roasted and ready.  So completely roasted and ready.  So what do we have to do at this stage? what do we have to do at this stage? what do we have to do at this stage? Look at it carefully, you can see that Look at it carefully, you can see that Look at it carefully, you can see that these granular spices are completely roasted and ready. these granular spices are completely roasted and ready. And see, it And see, it And see, it took us about 5 to 7 minutes to fry this spice.  About 5 to took us about 5 to 7 minutes to fry this spice.  About 5 to took us about 5 to 7 minutes to fry this spice.  About 5 to 7 minutes and I have roasted it on medium flame only 7 minutes and I have roasted it on medium flame only 7 minutes and I have roasted it on medium flame only because spices because spices because spices should never be roasted on high flame because should never be roasted on high flame because should never be roasted on high flame because if they catch fire from the bottom even a little then the if they catch fire from the bottom even a little then the if they catch fire from the bottom even a little then the taste of the entire recipe will be taste of the entire recipe will be taste of the entire recipe will be completely spoiled.  For this, always completely spoiled.  For this, always completely spoiled.  For this, always remember that whatever you are cooking, remember that whatever you are cooking, remember that whatever you are cooking, roast it on medium flame.  So roast it on medium flame.  So roast it on medium flame.  So guys, see, our masala was roasted. guys, see, our masala was roasted. guys, see, our masala was roasted. Now let us add our kidney beans here Now let us add our kidney beans here Now let us add our kidney beans here also.  And see, we will add all the kidney beans. also.  And see, we will add all the kidney beans. also.  And see, we will add all the kidney beans. And you remember one thing, And you remember one thing, And you remember one thing, we will not throw away the water that we took while boiling it. we will not throw away the water that we took while boiling it. we will not throw away the water that we took while boiling it. So we So we So we will use that also in this.  So will use that also in this.  So will use that also in this.  So we will make gravy from the water of kidney beans.  So for we will make gravy from the water of kidney beans.  So for we will make gravy from the water of kidney beans.  So for this, whenever you boil kidney beans, this, whenever you boil kidney beans, add water as per the amount of gravy you want to make because I will add water as per the amount of gravy you want to make because I will add water as per the amount of gravy you want to make because I will not add any extra water in it.  I have not add any extra water in it.  I have added the same water which I had added in the spices, i.e. about three to four teaspoons.  As for the added the same water which I had added in the spices, i.e. about three to four teaspoons.  As for the added the same water which I had added in the spices, i.e. about three to four teaspoons.  As for the remaining water, I have remaining water, I have remaining water, I have added kidney bean water to it because it gives a added kidney bean water to it because it gives a added kidney bean water to it because it gives a very good flavour.  So for this, you should also very good flavour.  So for this, you should also very good flavour.  So for this, you should also remember that whenever you make kidney beans remember that whenever you make kidney beans remember that whenever you make kidney beans or boil them, then or boil them, then add water as per the amount of gravy you want to add while boiling.  So just see, I had add water as per the amount of gravy you want to add while boiling.  So just see, I had add water as per the amount of gravy you want to add while boiling.  So just see, I had added a glass full of water in it and while it is added a glass full of water in it and while it is added a glass full of water in it and while it is cooking, it should become thick properly cooking, it should become thick properly cooking, it should become thick properly because I have to cook it a little with the spices also. because I have to cook it a little with the spices also. So just see, I have done it and So just see, I have done it and So just see, I have done it and added it nicely.  Now I just have to added it nicely.  Now I just have to cook it well with the spices so that my kidney beans get cook it well with the spices so that my kidney beans get cook it well with the spices so that my kidney beans get roasted well with the spices and the roasted well with the spices and the roasted well with the spices and the taste of the spices also comes well in the kidney beans taste of the spices also comes well in the kidney beans taste of the spices also comes well in the kidney beans because while boiling the kidney beans because while boiling the kidney beans because while boiling the kidney beans I had not added anything in it except I had not added anything in it except I had not added anything in it except salt.  So I just added one teaspoon of salt to it. salt.  So I just added one teaspoon of salt to it. salt.  So I just added one teaspoon of salt to it. So you can add salt as per your choice So you can add salt as per your choice So you can add salt as per your choice because I have added salt in Rajma earlier also. because I have added salt in Rajma earlier also. because I have added salt in Rajma earlier also. So for this, you must remember that So for this, you must remember that So for this, you must remember that I had added less than a teaspoon of salt in the gravy I had added less than a teaspoon of salt in the gravy I had added less than a teaspoon of salt in the gravy and I have added a teaspoon of salt in the rajma. and I have added a teaspoon of salt in the rajma. and I have added a teaspoon of salt in the rajma. So for this, you should also So for this, you should also So for this, you should also remember that always add less salt, that is, remember that always add less salt, that is, remember that always add less salt, that is, you can taste the salt after it is ready. you can taste the salt after it is ready. you can taste the salt after it is ready. If you feel it is less then add it, If you feel it is less then add it, If you feel it is less then add it, otherwise if it becomes more then the gravy will get otherwise if it becomes more then the gravy will get otherwise if it becomes more then the gravy will get spoiled.  So for this I spoiled.  So for this I spoiled.  So for this I added one teaspoon salt.  While boiling the kidney beans added one teaspoon salt.  While boiling the kidney beans added one teaspoon salt.  While boiling the kidney beans and spices, I have added only half a teaspoon of and spices, I have added only half a teaspoon of and spices, I have added only half a teaspoon of salt.  Just here you salt.  Just here you salt.  Just here you can see that my Rajma is completely ready. can see that my Rajma is completely ready. can see that my Rajma is completely ready. And look, I And look, I And look, I want the gravy this way.  I don't want a very thick gravy want the gravy this way.  I don't want a very thick gravy want the gravy this way.  I don't want a very thick gravy and I don't want a very thin gravy either.  This is exactly and I don't want a very thin gravy either.  This is exactly and I don't want a very thin gravy either.  This is exactly how I want it how I want it how I want it because I have to eat it with rice. because I have to eat it with rice. because I have to eat it with rice. So you also enjoy it, make it So you also enjoy it, make it So you also enjoy it, make it quickly.  This recipe is prepared very quickly. quickly.  This recipe is prepared very quickly. quickly.  This recipe is prepared very quickly. And you can see how And you can see how And you can see how amazing its look is. amazing its look is. amazing its look is. So guys, just see, I have cooked the So guys, just see, I have cooked the So guys, just see, I have cooked the kidney beans along with the spices for about 7 to 8 minutes kidney beans along with the spices for about 7 to 8 minutes kidney beans along with the spices for about 7 to 8 minutes so that the so that the so that the flavour of the spices also gets absorbed flavour of the spices also gets absorbed flavour of the spices also gets absorbed well into the kidney beans.  So well into the kidney beans.  So well into the kidney beans.  So guys, just look, our Rajma is ready. guys, just look, our Rajma is ready. guys, just look, our Rajma is ready. Now let's dish it Now let's dish it Now let's dish it out quickly.  So just look, here out quickly.  So just look, here out quickly.  So just look, here I have taken a bowl and in it we will I have taken a bowl and in it we will I have taken a bowl and in it we will dish out our kidney beans.  So just take it out dish out our kidney beans.  So just take it out dish out our kidney beans.  So just take it out quickly and eat it as you wish, quickly and eat it as you wish, quickly and eat it as you wish, with roti, chapati or rice. with roti, chapati or rice. with roti, chapati or rice. Actually, Rajma tastes very delicious Actually, Rajma tastes very delicious Actually, Rajma tastes very delicious with rice.  So please with rice.  So please with rice.  So please enjoy it with rice. enjoy it with rice. enjoy it with rice. Looks awesome, very yummy.  I think Looks awesome, very yummy.  I think Looks awesome, very yummy.  I think this would taste good with chapati too.  But this would taste good with chapati too.  But this would taste good with chapati too.  But you can eat it with whatever you like.  But you can eat it with whatever you like.  But you can eat it with whatever you like.  But Rajma Rice is my favourite.  So please Rajma Rice is my favourite.  So please Rajma Rice is my favourite.  So please make it, eat it, enjoy it and you make it, eat it, enjoy it and you make it, eat it, enjoy it and you can see how amazing the gravy has turned out. can see how amazing the gravy has turned out. can see how amazing the gravy has turned out. And please friend, my request And please friend, my request And please friend, my request is that you must like the video and subscribe to the channel. is that you must like the video and subscribe to the channel. is that you must like the video and subscribe to the channel. So come on, I So come on, I So come on, I told you I would eat it with rice. told you I would eat it with rice. told you I would eat it with rice. So for this I will take So for this I will take So for this I will take rice here.  And this is exactly the same simple rice here.  And this is exactly the same simple rice here.  And this is exactly the same simple rice that is made at home. rice that is made at home. rice that is made at home. Actually, we eat cumin rice with kidney beans.  But today Actually, we eat cumin rice with kidney beans.  But today Actually, we eat cumin rice with kidney beans.  But today I made simple rice because I had already I made simple rice because I had already I made simple rice because I had already prepared the rice.  I was not at all aware prepared the rice.  I was not at all aware prepared the rice.  I was not at all aware that I had to make rajma and I had that I had to make rajma and I had that I had to make rajma and I had soaked the rajma overnight.  So soaked the rajma overnight.  So soaked the rajma overnight.  So for this I made simple rice and for this I made simple rice and for this I made simple rice and rajma tastes very yummy with simple rice also. rajma tastes very yummy with simple rice also. rajma tastes very yummy with simple rice also. But what do most people do? But what do most people do? But what do most people do? Eat kidney beans with cumin rice.  So Eat kidney beans with cumin rice.  So Eat kidney beans with cumin rice.  So here I will eat Rajma with simple rice here I will eat Rajma with simple rice here I will eat Rajma with simple rice and see how tasty it tastes. and see how tasty it tastes. and see how tasty it tastes. Its look looks so amazing.  So Its look looks so amazing.  So Its look looks so amazing.  So friend, I just request you that whoever has friend, I just request you that whoever has friend, I just request you that whoever has not subscribed to my channel, please not subscribed to my channel, please not subscribed to my channel, please subscribe to my channel and subscribe to my channel and subscribe to my channel and press the bell icon so that he press the bell icon so that he press the bell icon so that he gets the notification of my videos immediately gets the notification of my videos immediately gets the notification of my videos immediately and please join me.  Enjoy.  Rajma and please join me.  Enjoy.  Rajma and please join me.  Enjoy.  Rajma rice with onions and salad is rice with onions and salad is rice with onions and salad is eaten as you like.  If you can keep cucumber, eaten as you like.  If you can keep cucumber, eaten as you like.  If you can keep cucumber, gherkin, carrot or any other salad here. gherkin, carrot or any other salad here. gherkin, carrot or any other salad here. And I will add a little lemon here And I will add a little lemon here And I will add a little lemon here because its taste increases with lemon. because its taste increases with lemon. because its taste increases with lemon. So let me add a little So let me add a little So let me add a little lemon here.  And then I'll lemon here.  And then I'll lemon here.  And then I'll eat it.  Its taste was very amazing. eat it.  Its taste was very amazing. eat it.  Its taste was very amazing. Believe me, this gravy was as Believe me, this gravy was as Believe me, this gravy was as tasty to look at as it was yummy to eat. tasty to look at as it was yummy to eat. tasty to look at as it was yummy to eat. Everyone in my house liked it very much, guys.   It Everyone in my house liked it very much, guys.   It Everyone in my house liked it very much, guys.   It is a very simple recipe.  It is a very easy is a very simple recipe.  It is a very easy is a very simple recipe.  It is a very easy recipe.  So please make it, eat it, recipe.  So please make it, eat it, recipe.  So please make it, eat it, enjoy it and please do subscribe to my channel.  Please enjoy it and please do subscribe to my channel.  Please press the bell icon so that you press the bell icon so that you press the bell icon so that you get instant notification of my upcoming videos.",
  "type": "youtube_video",
  "scraped_at": "2025-10-11T00:13:51.725052"
}