{
  "url": "https://www.youtube.com/watch?v=ZT3GlECfYoU",
  "title": "Chili - feat. Binging with Babish (You Suck at Cooking, episode 101)",
  "duration": 309,
  "content": "Kind: captions Language: en -  Some chilies have 20, 40, 600-plus ingredients. This one has 10, 'cause 10 is all you need. INTRO: (SINGING) You suck at cooking, yeah, you totally suck. -  We're gonna turn the stovetop on medium high, get in a teaspoon of oil, which isn't necessarily necessary. Then throw in around 2 pounds of ground beef. So we're gonna start by browning the beef. Why? [INTERPOSING VOICES] That's right. Browning creates flavor. Break it all up and let it sit for a couple minutes. Once that starts to get nice and brown on one side, we're gonna flip it, then let it sit again. Flip it and sit it. Just like do when your dog's bad. Just kidding, don't flip your dog. After a couple minutes, you can play meat peek-a-boo, just to check and see -- yep. That's browning, all right. See, we're getting some nice, brown, crusty particules in there. Gonna take a big, yellow onion. Preferably the kind with garlic built in the middle. And systematically demolish this into smithereens. And then add more garlic. Coat the bottom with a little bit of olive oil. Throw in the smithereens. We cook these until they just start to brown. What I'm gonna do is add in a little more olive sauce. We get both the built-in and independent garlic in there for just a couple minutes. Now I'm going to spoon our brown beef into there. You can add in 1 teaspoon of salt. I'm just gonna break that beef up a little bit more. I'm gonna take a can of crushed tomatoes. If you can't find powerstone crushed tomatoes, you can just give it a powerstone tap before you open it. You can also play the washboard. Now we'll just baptize that beef. (echoes) I hereby consecrate you with the power of tomato. You're probably gonna want to start turning that down before you get chili lava all over the place. Now I'm going to add 2 tablespoons of chili powder. Keep in mind that any powder that you add to chili automatically becomes chili powder. This cumin, for example, which I'm adding a tablespoon of, is now chili powder. Now I'll add in 1 cup of beef broth, because you want to create the sense that cattle are charging at you from multiple directions. Now I'll cover that and let it simmer on low. There's a bit of a debate in the chili world over whether or not you're supposed to include beans. And I can honestly say after doing a lot of research on this, who gives a [BLEEP]? If you like beans and chili, put beans and chili. If you don't like beans and chili but you dislike someone who also doesn't like beans and chili more than you dislike beans and chili, put beans and chili. So we'll open up a can of these chatty bastards. (Laughs while talking) Wash off the bastard sauce. *chuckles* Oh, no. Did you see the rag touch that bean? Ooh, guys, no. Kill it with fire. It's the right thing to do. So that's sputtering like a dirty mass airflow sensor. So we're just going to give that a bit of a wang  jangle. I'm gonna add in the old beans. Oh, whoops, I forgot. Half a tablespoon of brown sugar, 'cause we need as many brown things as possible. We're gonna let this simmer for another half an hour to an hour. Some people associate chili with toughness. Like, you're a lumberjack or someone who chops trees down. If you wanna sort of go down that toughness road, you can use a wang jangler that's attached to a brick, also known as a brang jangler. But if you're just a cool, laid-back dude with nothing to prove, you can use a tiny whisk, also known as a tang wangler. But if you're on a whole 'nother level of toughness, you can use a steel mace wang jangler, also known as a stang mangler. Additionally, you can also just add in no more than a single drop of tough sauce. Ooh, let's    be careful. And we'll just wang tangle that up. [SLURPS] 0% WABS. Toppings. Who needs 'em?  I do. Shredded cheddar, sour cream, scallion, chopped tomato, cilantro, tortilla chips, woodchips, everything in a special place forever. It's like you're building the meal on top of the chili. It's almost as if the chili becomes the most flavorful rice you could ever possibly imagine. That's a damn good chili. Alternatively, instead of putting things on chili, you could put chili on things, such as rice, a baked potato, or a hot dog. And luckily, I've got my pal Binging with Babish here, who's gonna show you how to make that hot dog. YSAC- Hey, what's up, guys? Welcome back to Binging with Babish. And today, we're gonna make a hot dog. BWB-  Ahem. BWB- How about I handle the hot dogs? YSAC-  I'm not sure what you mean, since clearly I'm Binging with Babish. BWB- Right. YSAC- I mean, I'm Binging with Babish, who is you. BWB - Yeah, well, you know what?  You suck at cooking. YSAC - Ouch, that hurt me right in the feelings. BWB - You know what, man, that was totally uncalled for. BWB - I'm sorry, under a lot of stress recently. Thank you very much for making the chili. YSAC - Still hurts, but you're welcome. Anyway, head on over to Binging with Babish to see how he handles that hot dog. And by the way, we both have cookbooks out, which you can get in stores or online. His totally awesome cookbook has a ton of great recipes by someone who knows what he's actually doing. And both books are great if you like looking at words, reading pictures, wrestling paper, lighting things on fire, or even reading. Here's a link to the chili dog. And links to both books are below. BWB out.",
  "type": "youtube_video",
  "scraped_at": "2025-08-24T18:19:35.348997"
}